<script setup lang="ts">
import { ElMessage } from "element-plus";
import type { FormInstance, FormRules } from "element-plus";
import { ref } from "vue";

defineOptions({
  name: "Edit",
});
const dialogTableVisible = ref(false)
const title = ref('')
// 获取数据
async function showEdit(val: any) {
  if (val === 1) {
    title.value = "会员协议";
  } else {
    title.value = "隐私协议";
  }
  // const dataForm = JSON.parse(row)
  // form.value.id = dataForm.id
  dialogTableVisible.value = true;
}
// 暴露方法
defineExpose({ showEdit });
</script>

<template>
  <div>
    <el-dialog v-model="dialogTableVisible" :title="title" style="width: 1000px !important;">
      <div v-if="title === '会员协议'">
        <h3>第一条 总则</h3>
        <br />
        <p>&emsp;&emsp;本会员协议是XXXXX公司在运营TCTASK问卷网（以下简称“本网站”）过程中，对会员（以下简称“会员”或“您”）参与市场问卷调查活动
          (以下简称“本服务”)时，为规范、落实、维护、确认会员的相关权益而与您订立的协议（以下简称“本协议”或“本会员协议”）。本会员协议适用于本网站会员，请您在使用本网站服务前，仔细阅读、理解本会员协议的条款内容，特别是免除或者限制TCTASK责任的条款、对会员权利进行限制的条款、约定争议解决方式、司法管辖和法律适用的条款。本会员协议中，限制、免责条款或者其他涉及您重大权益的条款可能以加粗或加下划线形式提示您重点注意。如您不同意本协议，可以继续使用本服务，但可能会导致我们无法向您提供完整的信息和服务，或无法达到本服务拟达到的效果。
        </p>
        <p>&emsp;&emsp;如您未满18周岁，请务必在监护人陪同下阅读本协议，监护人充分理解并同意您使用本服务后，您可以注册本网站会员。</p>
        <p>&emsp;&emsp;任何使用本网站服务或注册成为本网站会员的行为，视为同意本会员协议。</p>
        <br />
        <h3>第二条 定义</h3>
        <br />
        <p>除另有规定外，本会员协议中的词语或用语应具有以下所指定的含义：</p>
        <p>&emsp;&emsp;a：TCTASK为本公司的英文简称。本公司是一家根据中华人民共和国法律成立的数据研究调查领域的专业公司。</p>
        <p>&emsp;&emsp;b：会员：指根据TCTASK所制定的流程规则，同意本会员协议，注册本服务账号后，受到TCTASK可的用户。</p>
        <p>&emsp;&emsp;c：会员协议：指TCTASK与会员之间签订的关于使用TCTASK提供的服务的协议。</p>
        <p>
          &emsp;&emsp;d：个人信息：指会员在使用本服务的过程中，可能需要您提供的个人信息。该信息包含用户名、位置信息等可以识别特定的个人的信息（包括与其他信息结合后参照后，可以识别特定个人的信息），本网站可以据此进行会员积分奖励等有偿回馈。
        </p>
        <br />
        <h3>第三条 本协议的适用范围</h3>
        <br />
        <p>&emsp;&emsp;本协议的适用以注册账号成为本服务的会员、内部新增会员、使用本服务为前提，任何已注册的会员及其对本服务的使用行为均受本协议规则约束。</p>
        <br />
        <h3>第四条 协议的修改或更新</h3>
        <br />
        <p>&emsp;&emsp;TCTASK有权在不违反国家法律法规且不损害用户利益的基础上，可以对本协议进行更新。</p>
        <p>&emsp;&emsp;请会员理解并同意，为符合国家法律要求、满足平台安全的需要，TCTASK可能根据实际情况，对本服务功能性设置作出更改、对服务内容进行调整或作出终止本服务的决定。</p>
        <br />
        <h3>第五条 TCTASK的通知</h3>
        <br />
        <p>&emsp;&emsp;TCTASK将通过在本网站上登载以及其他TCTASK认为合适的方式，向会员公布或通知重要信息。</p>
        <p>&emsp;&emsp;条款规定的通知或公布的生效时间，以公告或通知记载的日期为准。</p>
        <br />
        <h2>第二章 会员</h2>
        <br />
        <h3>第六条 会员的注册</h3>
        <br />
        <p>您使用本服务或参与本网站活动时，应根据TCTASK制定的方法进行会员注册，会员注册应当遵守下列规则：</p>
        <p>&emsp;&emsp;a：账号名称、头像、简称等信息不得违反国家法律法规，不得出现容易误导的不良信息，不得违背社会公序良俗，不得侵害第三方的合法权益；</p>
        <p>&emsp;&emsp;b：不得冒用或顶替使用他人的信息；</p>
        <p>&emsp;&emsp;c：为保证您正常且完整地使用本服务，同时保证TCTASK正确地回馈会员，注册会员或进行登录时，应填写必要的真实身份信息或身份验证信息；</p>
        <p>&emsp;&emsp;d：进行会员本服务注册时，本网站允许使用第三方软件或平台账号进行登录或注册。但，您应当保证该第三方账号已经进行实名注册登记，并同意本会员协议的条款；</p>
        <p>&emsp;&emsp;e：注册会员账号后连续超过6个月未进行账号登录的，本网站有权收回您的账号。该账号及该账号内的所有信息将彻底删除，无法恢复；</p>
        <p>&emsp;&emsp;f：您注册账号时填写的信息应当真实、准确、合法、有效。如您提交的信息不准确、不真实或不合法，可能无法得到本网站给予会员的合理回馈；</p>
        <p>&emsp;&emsp;g：您应当自行妥善保管自己的账号及账号密码。如发生因会员保管不善或过失造成的密码丢失或盗号等情况，您应自行承担相应的后果；</p>
        <p>&emsp;&emsp;h：会员不得对其账号进行出租、转让、售卖、赠送等，上述行为一经发现，本网站有权认定该会员持有非法目的，对其采取封号等措；</p>
        <p>&emsp;&emsp;i：本服务网站系合法的商业网站。会员应当对自身行为导致的法律后果承担责任，不得利用网站平台实施危害国家利益或国家主权的违法行为、不得损害社会道德、不得损害公民的合法权益；</p>
        <p>&emsp;&emsp;j：您可自行注销会员账号。一旦注销，该账号的所有数据和信息即被删除，且无法恢复。因此，请谨慎采取注销账户的行为。</p>
        <p>您了解并同意，在申请注册会员前（以下简称“注册人”）已充分理解并同意本会员协议的条款内容。</p>
        <br />
        <h3>第七条 通过注册</h3>
        <br />
        <p>&emsp;&emsp;TCTASK将通过必要的程序审核、通过注册人的注册申请。通过会员注册的同时，本协议生效并对双方产生约束力。</p>
        <br />
        <h3>第八条 拒绝注册</h3>
        <br />
        <p>TCTASK认为注册人不具备成为会员的资格时，有权拒绝注册人的注册申请：</p>
        <p>&emsp;&emsp;a：存在使用外挂软件、恶意注册账号等行为，或存在成功注册账号后，使用非法技术手段获取活动的积分的行为，包括虚拟/复制活动样本、重复多次恶意参与活动、骗取活动积分等；</p>
        <p>&emsp;&emsp;b：存在其他经TCTASK判断被认为不合法或不符合注册条件的情况。</p>
        <br />
        <h3>第九条 本服务的使用和会员资格</h3>
        <br />
        <p>&emsp;&emsp;本服务仅面向18周岁以上的中国公民开放注册。14周岁以上未满18周岁的未成年人使用本服务前需要取得其父母或法定监护人的同意。未满
          14周岁的未成年人，禁止注册成为会员。如果您或您的被监护人未满14周岁使用本服务，或年满14周岁以上未满18周岁且未能取得监护人的同意或您未同意您的被监护人使用我们的服务，请您或被监护人立即停止使用我们的服务，并及时与我们取得联系。
        </p>
        <p>&emsp;&emsp;若您违反本会员协议，TCTASK将禁止您以任何方式使用本网站。</p>
        <p>
          &emsp;&emsp;若发生会员损害其他会员正当权益、违反国家相关法律法规、损害TCTASK的正当权益等的情况下，根据该会员侵权或违法违规的程度，本网站可以采取暂时冻结会员账号或积分、限制会员权限、限制服务提供、积分作废、删除会员资格等措施。
        </p>
        <p>&emsp;&emsp;如您有任何疑问，可通过本网站页面记载的客服电话进行申述或投诉。本网站将在合理范围内尽力调查有关事实，解决您的申述或投诉。</p>
        <p>&emsp;&emsp;本网站暂不支持向中国公民以外的人提供注册服务。如已经注册成功，请自行注销账号。</p>
        <br />
        <h2>第三章 会员义务</h2>
        <br />
        <h3>第十条 会员的账户及密码</h3>
        <br />
        <p>&emsp;&emsp;会员应当根据TCTASK制订的流程设置、更改、保存用户名以及密码。会员有证据证明系本网站原因导致账号泄密或盗号等情况的，本网站负责对该会员账号进行重置或更改。</p>
        <p>&emsp;&emsp;用户设置的会员名不得侵犯或可能侵犯他人合法权益、违反法律法规等国家的禁止规定，且不得违背公序良俗。</p>
        <p>&emsp;&emsp;会员有义务安全地使用、及保管会员用户名以及密码，并自行对账号管理承担责任。TCTASK不对会员自身原因（无论是否存在故意或过失）造成的结果以及损失负责，包括可能产生的积分损失。</p>
        <p>&emsp;&emsp;会员不得恶意注册账号或恶意点击，包括但不仅限于为获取积分或佣金多次重复点击，或通过注册多个账号参与某些指定的网络活动。本网站发现该些行为时 ，可以根据本协议采取相应的处理措施。</p>
        <p>&emsp;&emsp;请会员了解并同意，本网站不承认会员的用户名、密码等电子信息因含有特殊字符或其他有特殊意义而具有特殊价值，不对相关用户名、密码等的灭失、泄漏、被盗等承担本条第1款以外的任何责任。</p>
        <br />
        <h3>第十一条 会员的义务</h3>
        <br />
        <p>&emsp;&emsp;注册信息发生改变时，会员应及时通知TCTASK以便TCTASK进行更改，并协助会员注销账号或更正信息。会员应当向本网站提供该等信息确系其所有的证明，否则，本网站无法更改原注册账号的信息，或将原会员账号下的有效积分转出。
        </p>
        <p>&emsp;&emsp;会员参与TCTASK所组织的市场调查活动，在回答问卷时不得提供虚伪的数据或随意进行回答（例如，回答问卷时作出与之前的调查相矛盾的回答，或者作出统计数据上不可能的回答。） 会员了解并同意，
          本网站系统具备智能识别问卷逻辑正确性的功能，一旦系统判断存在逻辑性问题或回答问卷存在前后矛盾等现象的时，本网站有权自动中断该次问卷调查活动。该情况下，会员无法获取相应的积分。</p>
        <p>
          &emsp;&emsp;会员使用本网站服务过程中应遵守国家法律、法规等规范性文件及本网站各项规则的规定和要求，不得违背社会公共利益或公共道德，不得损害他人的合法权益。会员违反前述规定给第三方造成损害，应自行承担因此产生的任何法律后果，不得给TCTASK造成任何负担和损害。
          会员因利用本服务而与第三方之间产生争议（不限于诉讼，索赔及其他请求均包括在内）的，应当自行负担争议处理与解决的责任和费用，不得给TCTASK造成任何负担和损害。TCTASK因会员与第三方间产生争议而遭受损害的（包括第三方要求TCTASK承担连带责任的情况），有权要求会员对TCTASK遭受的损害及随之发生的费用（包括律师费用）进行赔偿或补偿。
        </p>
        <p>
          &emsp;&emsp;会员不得使用任何程序、装置、外挂软件干预或试图干预本网站平台的正常运行，或实施加重本网站网络设备负担的行为。上述行为一经发现，本网站可以根据判断认定结果，不经会员同意或提前通知，自行适用相应规则采取予以处理措施或终止向会员提供本服务。
        </p>
        <p>
          &emsp;&emsp;本网站显示的资料（包括但不限于文字、图表、标识、图像、电子下载和数据编辑）、汇编内容、软件（以下简称“资料等”）均归属本网站或其内容提供者所有，会员不得以复制、传播、引用等任何方式使用本网站上显示的资料等，不得对本网站上的资料等作任何商业性用途（包括用于未被本网站授权的会员或任何第三方的广告）。上述资料等的知识产权及相关权益均受法律保护，侵权行为一经发现，TCTASK将追究会员的法律责任，并有权要求会员赔偿TCTASK因此遭受的损失。
        </p>
        <p>&emsp;&emsp;会员不得在本网站散发、发布广告，或进行其他任何形式的推广及广告。会员的前述行为 违反广告法的，应自行承担法律后果。给TCTASK造成损失的，TCTASK有权追究其法律责任，并要求其赔偿因此遭受的损失。</p>
        <p>&emsp;&emsp;会员不得以虚构或欺诈的方式参加本网站上的相关活动，不得采取不正当方式提高自身的信用度、等级，积分等。</p>
        <p>&emsp;&emsp;会员了解并同意，根据中国法律，使用本网站服务过程中所产生的个人收益应当进行纳税申报。</p>
        <br />
        <h2>第四章 服务</h2>
        <br />
        <h3>第十二条 本服务内容的更改和终止</h3>
        <br />
        <p>&emsp;&emsp;会员了解并同意，TCTASK有权根据视具体情况更改本服务的使用条件和规则，或者改变服务的内容、功能设置、范围、中断中止乃至终止本服务及相关服务。本服务的更改，包括但不限于本服务部分内容或全部内容的更改和终止。</p>
        <p>&emsp;&emsp;会员理解并同意，本服务存在第十六条、第十七条规定的中止、暂停、终止等风险。TCTASK不对会员因TCTASK中止、暂停、终止本服务而遭受的损害承担任何责任。</p>
        <br />
        <h2>第五章 积分</h2>
        <br />
        <h3>第十三条 积分和奖励</h3>
        <br />
        <p>
          &emsp;&emsp;严禁通过虚假的参与行为获取积分，或通过分批次地利用网站漏洞、外挂软件或其他非法软件获取积分，利用虚假注册的会员账号恶意参与项目或通过其他非法手段获取积分。上述行为一经发现，本网站有权取消会员资格，并追回已经支付的全部积分或奖励，同时会员必须承担由此给本网站带来的所有损失。
        </p>
        <p>&emsp;&emsp;本网站按照规定进行积分结算积分计入会员在本网站指定的个人账户。</p>
        <p>&emsp;&emsp;积累一定数量的积分后，会员可以自由地申请将积分兑换成奖励。</p>
        <p>&emsp;&emsp;除会员存在违反相关法律法规或本协议的情况外，本网站将在收到会员的兑换申请后，按照规定予以兑现。</p>
        <p>&emsp;&emsp;因会员自身过失造成其注册信息泄露，导致积分无法累积或者无法兑换，TCTASK对此不负任何责任。</p>
        <p>&emsp;&emsp;会员进行积分兑换时产生的税费、兑换现金时的手续费，以及使用积分购买的服务或者商品产生的税费以及其他任何费用，均由会员自行承担。会员了解并同意，按照中国相关法律法规，经积分兑换所取得的收益将纳入个人纳税申报体系。</p>
        <p>&emsp;&emsp;任何会员均可就违法违规行为向本网站投诉。对于能帮助网站提高管理水平和效率的纠错行为，本网站将视具体情况及时予以积分奖励。</p>
        <br />
        <h3>第十四条 积分奖励的取消</h3>
        <br />
        <p>&emsp;&emsp;会员存在提供虚假信息、错误信息等行为，一经TCTASK查证属实，TCTASK可以视情况取消或者减少赠与会员的积分。</p>
        <p>&emsp;&emsp;本协议第二十一条规定的会员资格失效会员户注销后，会员所获得的积分也将同时失效。</p>
        <br />
        <h2>第六章 使用上的限制、服务的中断以及终止</h2>
        <br />
        <h3>第十五条 使用上的限制</h3>
        <br />
        <p>下列情况下，TCTASK可以未经会员同意，限制会员使用本服务，且不对会员因此遭受的损失承担任何责任：</p>
        <p>&emsp;&emsp;a：TCTASK根据会员使用本服务的状况，以及TCTASK获取的其他信息，判断该会员的账号，用户名以及密码未经允许被第三者使用时；</p>
        <p>&emsp;&emsp;b：经TCTASK判断，认为会员行为违反本会员协议的约定时；</p>
        <p>&emsp;&emsp;c：上述以外经TCTASK判断，认为发生紧急情况需要限制本服务使用时；</p>
        <p>&emsp;&emsp;d：经TCTASK判断，被认定为虚假注册的会员或批量注册的会员；</p>
        <p>&emsp;&emsp;e：经TCTASK判断，认为会员利用外挂软件等批量参与项目，谋取高额回馈时；</p>
        <p>&emsp;&emsp;f：其他经TCTASK判断为非法的行为等时。</p>
        <br />
        <h3>第十六条 服务的暂时中断</h3>
        <br />
        <p>下列情况下，TCTASK可以未经事先通知，暂时中止本服务。TCTASK不对该等原因造成服务的延迟和中断给会员或第三方的损失承担任何责任：</p>
        <p>&emsp;&emsp;a：定期以及临时发生的本服务系统的维护、修理、检查或更改；</p>
        <p>&emsp;&emsp;b：因火灾、停电等原因造成的本服务的中断；</p>
        <p>&emsp;&emsp;c：因地震、火山、洪水、海啸等天灾造成的本服务的中断；</p>
        <p>&emsp;&emsp;d：因战争、动乱、暴动、骚乱、劳动争议所造成的本服务的中断；</p>
        <p>&emsp;&emsp;e：经TCTASK判断认为在运营或技术上有必要中断服务时；</p>
        <p>&emsp;&emsp;f：法律规定的终止、中止、暂停等情形时。</p>
        <br />
        <h3>第十七条 服务的终止</h3>
        <br />
        <p>&emsp;&emsp;TCTASK可以在不事先通知用户的情况下，全部或者部分终止服务。</p>
        <p>&emsp;&emsp;TCTASK终止提供本服务并完成相应的法定程序后，不再对因本服务产生或与本服务相关的纠纷承担任何法律责任。</p>
        <br />
        <h2>第七章 违反会员协议的处理方法</h2>
        <br />
        <h3>第十八条 禁止事项</h3>
        <br />
        <p>会员在使用本服务时不应从事下列行为：</p>
        <p>&emsp;&emsp;a：违反公共道德的行为；</p>
        <p>&emsp;&emsp;b：违反法律法规的行为；</p>
        <p>&emsp;&emsp;c：发布胁迫、中伤、猥亵、低俗以及煽动信息；</p>
        <p>&emsp;&emsp;d：参与战争、动乱、暴动、骚乱或劳动争议造成本服务中断；</p>
        <p>&emsp;&emsp;e：实施阻碍市场调查活动的行为；</p>
        <p>&emsp;&emsp;f：发送垃圾邮件或者病毒；</p>
        <p>&emsp;&emsp;j：重复进行市场信息注册；</p>
        <p>&emsp;&emsp;h：将调查内容、商业标志、商标公开或者泄露给第三方；</p>
        <p>&emsp;&emsp;i：盗用账户以及密码、虚假注册、重复虚假注册；</p>
        <p>&emsp;&emsp;j：作出不真实的回答；</p>
        <p>&emsp;&emsp;k：出售、出借会员账号；</p>
        <p>&emsp;&emsp;l：买卖积分；</p>
        <p>&emsp;&emsp;m：除上述第1-12项之外，其他经TCTASK判断认为不合适的行为。</p>
        <br />
        <h3>第十九条 由会员发起解约</h3>
        <br />
        <p>&emsp;&emsp;会员希望解约时，应当注销账号，并应根据TCTASK所指定的方法完成相关手续。</p>
        <p>&emsp;&emsp;账号的注销不影响此前使用本服务的行为，会员仍需对注销账户前的行为承担相应的法律后果。</p>
        <p>&emsp;&emsp;会员了解并同意，账号注销成功后，账号及账号内的所有信息、功能将无法恢复。</p>
        <br />
        <h3>第二十条 由TCTASK发起的解约</h3>
        <br />
        <p>&emsp;&emsp;发生本协议第六条规定的会员注册申请信息不完备、会员未履行第十一条规定的会员义务或违反第十八条所规定的禁止事项时，TCTASK有权在不事先通知会员的情况下随时解约，且不对此承担任何责任。</p>
        <br />
        <h3>第二十一条 会员资格失效</h3>
        <br />
        <p>&emsp;&emsp;根据第十九条或者第二十条的规定解约后，会员资格自动失效。</p>
        <p>&emsp;&emsp;会员资格失效后，TCTASK系统将立即删除会员的所有信息。积分和奖励金额同时失效。</p>
        <br />
        <h2>第八章 损失的赔偿</h2>
        <br />
        <h3>第二十二条 法律依据</h3>
        <br />
        <p>&emsp;&emsp;本协议引起或本协议相关的损害赔偿根据2021年1月1日实施的《中华人民共和国民法典》侵权相关法条加以解决。</p>
        <br />
        <h3>第二十三条 免责事项</h3>
        <br />
        <p>&emsp;&emsp;请您了解并同意，在任何情况下， TCTASK不为任何间接的、偶然性的、特殊的或惩罚性损失向客户或其他第三方承担责任，亦不为会员自身造成或其他第三方直接造成的任何损失承担责任。</p>
        <p>&emsp;&emsp;除具有故意或重大过失的情况之外，TCTASK对会员补偿或赔偿金额的上限，不超过会员积分可兑换的等价现金金额。超出该上限的部分，TCTASK不承担责任。</p>
        <br />
        <h3>第二十四条 会员间的情况</h3>
        <br />
        <p>&emsp;&emsp;会员之间不得就本服务进行任何信息交换，TCTASK不对相关附带的行为产生的后果承担任何责任。</p>
        <br />
        <h2>第九章 个人信息</h2>
        <br />
        <h3>第二十五条 个人信息的处理</h3>
        <br />
        <p>TCTASK将根据《隐私协议》，遵循合法、正当、必要和诚信原则，通过非误导、非欺诈、非胁迫等方式合法地处理个人信息。</p>
        <p>&emsp;&emsp;a：不得非法收集、使用、加工、传输会员个人信息，不得非法买卖、提供或者公开会员个人信息，不得从事危害国家安全、公共利益的个人信息处理活动；</p>
        <p>&emsp;&emsp;b：处理个人信息前应当取得会员个人同意；</p>
        <p>&emsp;&emsp;c：会员有权随时撤回其同意，撤回同意后，TCTASK将停止相关个人信息处理活动；</p>
        <p>&emsp;&emsp;d：TCTASK指定专门人员处理个人信息相关事项</p>
        <p>TCTASK所取得的个人信息的处理目的、处理方式和处理个人信息种类如下：</p>
        <p>&emsp;&emsp;a：将通过个人、群体回答得到的市场区域信息或大数据信息提供给客户，但不涉及个人特有信息；</p>
        <p>&emsp;&emsp;b：以无法识别特定个人的形式用于统计数据；</p>
        <p>&emsp;&emsp;c：用于给用户发送奖品或者邮件、兑换积分等；</p>
        <p>&emsp;&emsp;d：为保证调查的正确性与回答质量而进行的联络；</p>
        <p>&emsp;&emsp;e：改善TCTASK所提供的服务以及信息内容的质量；</p>
        <p>&emsp;&emsp;f：在TCTASK新服务开始时，面向会员的告知以及引导；</p>
        <p>&emsp;&emsp;g：其他《用户隐私协议》及相关通知规定的处理目的、处理方式等。</p>
        <p>&emsp;&emsp;会员了解并同意，本网站有权根据相关法律法规或政府部门（包括司法及行政部门）的要求，提供会员在本网站填写的注册信息和交易记录等必要信息。</p>
        <p>&emsp;&emsp;TCTASK根据国家相关法律法规的规定保护未成年人的个人信息。对于经父母或法定监护人同意而收集的未成年人个人信息，我们只会在法律允许、父母或法定监护人明确同意或者保护未成年人所必要的情况下,使用或公开披露此信息。
        </p>
        <br />
        <h2>第十章 其他</h2>
        <br />
        <h3>第二十六条 知识产权的归属</h3>
        <br />
        <p>
          &emsp;&emsp;会员在本网站上提供的信息或使用本服务产生的信息，不会发生任何著作权使用费。对于本人回答市场调查产生的样本内容、信息等，会员授予TCTASK非独占的许可使用权，以及向其关联公司分许可的权利。会员理解并同意，TCTASK有权不经会员同意或者对会员支付补偿，在全世界范围内以任何方式使用、复制、修正、改变、翻译、引用、二次创作、传输、发布、登载上述样本内容、信息等。
        </p>
        <br />
        <h3>第二十七条 责任限制</h3>
        <br />
        <p>
          &emsp;&emsp;本网站登载的广告活动、购物信息、游戏等信息随时可能发生变动，本网站无须就此进行特别通知。会员了解并同意本网站已在合理范围内已在合理范围内尽最大努力保证会员所浏览的信息的准确性，但由于网上信息数量极其庞大，以及众所周知的互联网技术因素等客观原因，本网站显示的信息可能存在一定的滞后性和纰漏，敬请会员谅解。
        </p>
        <p>针对以下各项行为，TCTASK不承担责任：</p>
        <p>&emsp;&emsp;a：会员应当依据自行判断选择使用本服务。对于因电子机器，软件及通信线路等设备无法适配而产生的障碍，TCTASK不承担任何责任；</p>
        <p>&emsp;&emsp;b：为使用本服务必须使用第三者制造的终端设备及第三者提供的网络连接服务，对于该种设备及服务的质量、性能、规格式样，TCTASK不作任何保证，对于可能因此产生的损害，无论预见可能与否，TCTASK亦不承担任何责任。另外，第三者设备或服务质量、性能、规格式样、使用条件等的变化可能导致本服务无法继续使用，针对此种变化TCTASK不作任何保证，对于可能因此产生的损害，无论预见可能与否，TCTASK亦不承担任何责任；
        </p>
        <p>&emsp;&emsp;c：本服务的质量可能受到通信线路连接状况或通信速度、使用者终端设备性能等各种因素的影响。无论该种可能性存在与否，对于会员使用本服务时的质量，TCTASK不做任何保证，对于会员无法连接使用本服务等情况，TCTASK亦不承担任何责任。
        </p>
        <br />
        <h3>第二十八条 链接</h3>
        <br />
        <p>
          &emsp;&emsp;会员可以通过本网站的链接跳转至第三方合作机构所运营/持有的网站（以下简称“第三方网站”）。尽管TCTASK已对第三方网站或者第三方网站所宣传、提供、或者贩卖的产品进行详细告知，并已严格遵守相关法律规定的要求，但TCTASK无法全面对第三方网站的实施、运营以及第三方网站上所包含的丰富信息进行监控或控制。如您发现第三方网站所运营以及实施的项目，或第三方网站本身方可能存在不合理、不合法行为的迹象时，请及时告知本网站，TCTASK对相关情况进行调查，并采取相应的措施。
        </p>
        <br />
        <h3>第二十九条 可分割性</h3>
        <br />
        <p>&emsp;&emsp;本会员协议的部分条款无效或不可执行不影响其他条款的效力或执行，剩余条款应视为继续有效。</p>
        <br />
        <h3>第三十条 准据法及争议解决</h3>
        <br />
        <p>&emsp;&emsp;本会员协议的订立、生效、执行、解释等均适用中国法律。</p>
        <p>&emsp;&emsp;凡因本会员协议引起的或与本协议有关的任何争议，均应首先通过友好协商解决，经协商仍无法解决的，应提交TCTASK所在地具有管辖权的法院，通过诉讼的方式加以解决。</p>
        <br />
        <h3>第三十一条 同意</h3>
        <br />
        <p>&emsp;&emsp;会员在使用TCTASK的服务，或者成为TCTASK会员时，将视为同意本会员协议。</p>
        <br />
        <h3>第三十二条 未成年人的个人信息及市场调查活动的参与</h3>
        <br />
        <p>
          &emsp;&emsp;TCTASK重视未成年人个人信息的保护。若您1是4周岁以上未满18岁周岁以下的未成年人，在使用我们的服务前，应事先取得您家长或法定监护人的书面同意。TCTASK我们将根据国家相关法律法规的规定更为严格地保护未成年人的个人信息。正如前面上述第9条所述，
          TCTASK原则上禁止未满14周岁的未成年人使用本网站服务。</p>
        <p>&emsp;&emsp;对于因参与活动的有关问卷，因为不涉及到个人信息， TCTASK对此样本予以采信。</p>
        <p></p>
      </div>
      <div v-else>
        <h3>1.个人数据</h3>
        <br />
        <h4>基本信息</h4>
        <p>姓名、出生日期、性别、TCTASK账户信息</p>
        <h4>联系信息</h4>
        <p>手机号码、电子邮件地址，以及其他联系信息。</p>
        <h4>用户属性信息</h4>
        <p>与市场调查必要的关联性的信息：比如国内外分类、居住地区、婚姻状况、性别、就业状况、职业、职位、汽车和摩托车持有信息、访问过的国家、持有的手机和智能手机型号，以及其他用户属性信息。</p>
        <h4>调查结果</h4>
        <p>我们收集的调查回复。</p>
        <h4>用户日志/记录</h4>
        <p>用户的服务使用记录、访问日志、浏览器指纹记录，以及其他日志/记录。</p>
        <h4>电子/在线标识符</h4>
        <p>
          设备标识符、Apple账户标识符、广告标识符、IP地址、cookies、用户代理、微信账号标识符、微信唯一ID、QQ账号标识符、新浪微博账号标识符、微信及其他用户头像、MAC地址、音频及视频、位置信息，以及其他电子/在线标识符。
        </p>
        <br />
        <h3>2. 处理目的</h3>
        <br />
        <p>&emsp;&emsp;我们处理个人数据用于以下目的以及所适用的法律法规允许的其他类似目的。此外，我们还可能对个人数据进行聚合。</p>
        <p>&emsp;&emsp;身份验证和认证、使用第三方账户进行会员注册、识别未经授权使用我们服务的用户、防止重复注册、发送电子邮件或其他在线消息、接收和处理查询以及移动应用管理；</p>
        <p>&emsp;&emsp;提供调查、产品、赠品和服务相关的信息、发货、举办活动、提供奖励以及兑换移动礼品券、现金和积分；</p>
        <p>&emsp;&emsp;筛选监控人；</p>
        <p>&emsp;&emsp;验证调查回复的状态并检测任何重复回复；</p>
        <p>&emsp;&emsp;用于市场研究公司进行的研究；</p>
        <p>&emsp;&emsp;应用数据分析、服务改进以及开发新的调查和数据分析服务。</p>
        <p>&emsp;&emsp;使用数据主体的信息，通过分析客户访问网站时的信息，实现我们网站提供的服务平稳运行和改进； </p>
        <br />
        <h3>3. 处理的法律依据</h3>
        <br />
        <p>&emsp;&emsp;我们根据所适用的数据保护法规的法律依据处理个人数据（例如，需要数据主体同意、履行合同义务、追求正当利益，以及遵守相关法律法规等）。有关所适用的法律依据，请参阅各司法管辖区的附件。
          由于法定或合同要求或其他原因，提供您的个人数据可能是强制性的。具体而言，如果在需要提供个人数据的情况下您未提供，我们可能无法向您提供任何我们的产品或服务（包括我们的网站和应用程序）。</p>
        <p>&emsp;&emsp;我们根据所适用的数据保护法规的法律依据处理个人数据（例如，需要数据主体同意、履行合同义务、追求正当利益，以及遵守相关法律法规等）。有关所适用的法律依据，请参阅各司法管辖区的附件。
          由于法定或合同要求或其他原因，提供您的个人数据可能是强制性的。具体而言，如果在需要提供个人数据的情况下您未提供，我们可能无法向您提供任何我们的产品或服务（包括我们的网站和应用程序）。</p>
          <br />
        <h3>4. 个人数据的保存期限</h3>
        <br />
        <p>&emsp;&emsp;为了确定个人数据的适当保留期限，我们将考虑以下因素：个人数据的数量、性质和保密性；因不正当使用或披露个人数据而造成损害的潜在风险；处理目的，以及我们是否可以通过其他方式实现这些目的；以及所适用的法律要求。
</p>
        <p>&emsp;&emsp;当个人数据保留期限到期或处理目的达到等没有必要保留时，我们将立即删除个人数据。但是，为了防止重复注册和监测欺诈用户，我们将在会员资格被撤销后保存所有在会员注册和其他会员活动中的注册信息，保存期限为180天。</p>
        <p>&emsp;&emsp;如果根据相关法律法规需要将个人数据保存一定期限，将会按照相关规定进行单独保存。</p>
        <br />
        <h3>5. 个人数据来源</h3>
        <br />
        <p>&emsp;&emsp;我们直接从个人获取数据主体的个人数据（包括自动获取个人数据的情形）。例如，通过我们的网站和应用程序，以及通过日志分析程序和“cookies”获取其他数据。但在以下情况下，我们可能会从第三方间接获取数据主体的个人数据：</p>
        <p>&emsp;&emsp;a：从我们的业务合作伙伴处获取个人数据；</p>
        <p>&emsp;&emsp;b：从网站流量分析服务提供商处获取个人数据；</p>
        <p>&emsp;&emsp;c：从第三方合法获取个人数据的任何其他情况（包括公共信息）。</p>
        <br />
        <h3>6. 共享个人数据</h3>
        <br />
        <p>在以下情况下，我们可能会与第三方共享上述“1. 处理的个人数据类别”中列出的个人数据：</p>
        <p>&emsp;&emsp;a：与调查机构和广告商共享个人数据；</p>
        <p>&emsp;&emsp;b：与公司出售、合并、收购或以其他方式转让我们全部或部分资产相关的个人数据共享；</p>
        <p>&emsp;&emsp;c：根据所适用的法律或政府机构命令等的要求共享个人数据；</p>
        <p>&emsp;&emsp;d：在（i）为保护TCTASK或我们的员工、数据主体或第三方的生命、身体或财产所需，以及（ii）所适用的数据保护法规所允许，等情况下与第三方共享个人数据；</p>
        <p>&emsp;&emsp;e：经数据主体同意的情况下共享个人资料；</p>
        <p>&emsp;&emsp;f：在其他所适用的数据保护法规允许的情况下共享个人数据。</p>
        <br />
        <h3>7. 安全管理措施</h3>
        <br />
        <p>&emsp;&emsp;在处理您的个人数据时，我们将采取以下技术和管理措施，以确保数据安全，从而避免其丢失、被盗、泄露、篡改或损坏。但是，如果由于您的失误而非归咎于我们的原因造成任何个人数据问题，我们不承担任何责任。</p>
        <h4>技术措施</h4>
        <p>&emsp;&emsp;个人数据加密：您的个人数据受密码保护，重要数据在存储和数据传输过程中都会加密，通过安全功能保护您的个人数据。</p>
        <p>&emsp;&emsp;防御黑客攻击和计算机病毒的措施：我们尽最大努力防御因黑客攻击或计算机病毒而导致您的个人数据泄露或损坏。我们将定期更新最新的防病毒程序，以防止个人数据或数据泄漏或损坏，并采取必要措施控制对其他个人数据的访问。</p>
        <h4>管理措施</h4>
        <p>&emsp;&emsp;最小化处理个人数据的人员及培训：处理个人数据的员工仅限于履行个人数据管理职责的人员，如个人数据保护官和其他负责人，并始终通过对这些人员的频繁培训强调遵守《全球隐私政策》。</p>
        <br />
        <h3>8. Cookies、AdID和IDFAs</h3>
        <br />
        <h4>使用 cookie、AdID和IDFAs的目的</h4>
        <p>&emsp;&emsp;您可以选择设置cookie、AdID和IDFAs。因此您可以在网络浏览器和移动应用程序的选项设置中接受或拒绝存储 Cookie、AdID或IDFAs。</p>
        <h4>如何拒绝 cookie 设置</h4>
        <p>&emsp;&emsp;您可以在网络浏览器中选择以下选项来拒绝设置Cookie：允许所有cookie、每次保存cookie时要求确认，或拒绝保存所有cookie的选项：</p>
        <p>&emsp;&emsp;Microsoft Edge：设置及其他>设置>站点权限>Cookie和站点数据</p>
        <p>&emsp;&emsp;Chrome浏览器：更多>设置>隐私设置和安全>网站设置>第三方cookie</p>
        <p>&emsp;&emsp;但是，如果您拒绝接受Cookie，我们在提供服务时可能会遇到困难。</p>
        <br />
        <h3>9. 数据主体的权利</h3>
        <br />
        <p>&emsp;&emsp;我们尊重数据主体根据每个国家和地区所适用的数据保护法规项下所拥有的权利。例如，在这些法规允许的范围内，数据主体可享有以下权利：访问权、更正权、删除权、限制处理权、反对处理权、撤销同意权（如果数据主体已就某些处理活动表示同意，则可授予撤回同意权；但数据主体撤回同意并不影响在撤回前基于该同意进行的处理的合法性）、数据可携带性权，以及不受自动化决策约束的权利。日本《个人信息保护法》（“APPI”）赋予了用户有权提出有关所持个人数据（指APPI 第16条第4款规定的所持个人数据）的权利：告知使用目的、披露、更正、追加或删除内容、暂停使用、删除或第三方提供，以及披露第三方提供记录（指 APPI第37条第2款规定的第三方提供记录）。</p>
        <p>&emsp;&emsp;若数据主体希望行使相关国家或地区的数据保护法规项下被赋予的权利，数据主体可通过下一条提供的联系方式与我们联系。</p>
        <br />
        <h3>10. 联系方式</h3>
        <br />
        <h4>产品和/或服务的运营者信息：</h4>
        <p>运营主体：xxxxx</p>
        <p>注册地址：xxxxxxxx</p>
        <p>相关负责人联系方式：【x'x'x'x'x'x'x'x】</p>
        <h4>联系我司的方式：</h4>
        <p>通过电话x'x'x'x'x'x'x'x进行投诉，意见提交或咨询等</p>
        <br />
        <h3>11. 《全球隐私政策》的修订</h3>
        <br />
        <p>&emsp;&emsp;如果我们计划修订《全球隐私政策》，我们可以通过在我们的网站上发布修订内容、向我们的客户发送相关电子邮件，或通过我们认为适当的其他方式通知的形式对《全球隐私政策》的全部或部分内容进行修改。在此情况下，《全球隐私政策》修订后的版本将在您收到此类通知后首次使用我们的产品或服务或首次访问我们的网站的日期，或通知中所述日期中较早的日期开始适用。</p>
        <br/>
        <p>生效日期：2024年3月31日</p>
        <p>最后更新日期：2024年3月31日</p>
        <p>附件: 中国</p>
        <br/>
        <p>本附件适用于位于或居住于中国大陆地区（不包括香港、澳门及台湾。以下称“中国”）的数据主体。</p>
        <p>另外，我们在中国境外处理数据主体的个人数据的活动接受中国的《个人信息保护法》的域外适用时，也适用本附件规定。</p>
        <br/>
        <h4>处理的法律依据</h4>
        <p>&emsp;&emsp;我们在处理个人数据时，经取得您同意后按照合法、正当、必要及诚信原则予以处理。您对《全球隐私政策》及本附件的同意包含有关该个人数据处理的同意。但是，符合以下规定事由时，我们根据中国的《个人信息保护法》无需经您同意即可处理个人数据。</p>
        <p>&emsp;&emsp;为签订、履行以您作为一方当事人的合同所必需；</p>
        <p>&emsp;&emsp;为履行法定职责或法定义务所必需；</p>
        <p>&emsp;&emsp;为应对突发公共卫生事件，或在紧急情况下为保护自然人的生命健康和财产安全所必需；</p>
        <p>&emsp;&emsp;为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人数据；</p>
        <p>&emsp;&emsp;依照中国的《个人信息保护法》规定在合理的范围内处理您自行公开或者其他已经合法公开的个人数据；</p>
        <p>&emsp;&emsp;法律、行政法规规定的其他情形。</p>
        <h4>数据主体的权利</h4>
        <p>&emsp;&emsp;我们保障您对自己的个人数据行使以下权利。但是，法律、行政法规中另有规定的不在此限。</p>
        <p>&emsp;&emsp;知情权与决定权：您对您的个人数据的处理享有知情权、决定权，有权限制或者拒绝他人对其个人数据进行处理。</p>
        <p>&emsp;&emsp;查阅、复制：您有权查阅、复制您的个人数据。您请求查阅、复制其个人数据时，我们将及时提供。</p>
        <p>&emsp;&emsp;转移：您请求将个人数据转移至其指定的个人信息处理者，符合国家网信部门规定条件的，我们将提供转移的途径。</p>
        <p>&emsp;&emsp;更正与补充：您发现其个人数据不准确或者不完整的，您有权要求我们对其个人数据处理规则进行解释说明更正、补充。您请求更正、补充其个人数据的，您有权要求我们对其个人数据处理规则进行解释说明将对您个人数据予以核实，并及时更正、补充。</p>
        <p>&emsp;&emsp;删除：有下列情形之一的，您有权要求我们对其个人数据处理规则进行解释说明删除个人数据：（1）处理目的已实现、无法实现或者为实现处理目的不再必要；（2）我们停止提供产品或服务，或者保存期限已届满；（3）您撤回同意；（4）我们违反法律、行政法规或者违反约定处理个人数据；或者（5）法律、行政法规规定的其他情形。</p>
        <p>&emsp;&emsp;要求说明处理规则的权利：您有权要求我们对您个人数据处理规则进行解释说明。</p>
        <p>&emsp;&emsp;撤回同意：基于您同意处理个人数据的，您有权撤回其同意。</p>
        <p></p>
      </div>
      <template #footer>
        <div style="flex: auto">
          <el-button type="" @click="dialogTableVisible = false">
            取消
          </el-button>
        </div>
      </template>
    </el-dialog>
  </div>
</template>

<style scoped lang="scss">
p {
  // text-indent: 2em;
  padding: 0 3.625rem;
  /* 首行缩进 2em */
}

h4 {
  text-indent: 2em;
  /* 首行缩进 2em */
}
</style>
